# ************************************************************88
# РАЗДЕЛ ИМПОРТА МОДУЛЕЙ
# HBVJVWEJFVJWEVFVWU

# KHBFHHVVVVVIVIVVV
# РАЗДЕЛ СОЗДАННЫХ ФУНКЦИЙ
# VJVJVGVJVJGVVJGVGVVGV
def chotoDrugoe():
    trup = ['''
 +---+
     |
     |
     |
    ===''','''
 +---+
 0   |
     |
     |
    ===''','''
 +---+
 0   |
 |   |
     |
    ===''','''
 +---+
 0   |
/|   |
     |
    ===''','''
+---+
 0   |
/|   |
     |
    ===''','''
+---+
 0   |
/|\  |
     |
    ===''','''
+---+
 0   |
/|\  |
/    |
    ===''','''
+---+
 0   |
/|\  |
/ \  |
    ===''']

    return trup

def genZNCH():
    per1 = ['аист акула волк кит паук  агути абия кирилл леново мамонт слон сипуха морж жаворонок шелкопряд барсук бобр белка конь лошадь лис крокодил алигатор маккака попугай жук бабочка ящерица лягушка жаба ворон грач кот собака орёл крыса мышь бабуин хомяк медведь волк уж змея ягненок баран козел овца '.split()' ']
    return per1
    
# 8888888888888888888888
# ОСНОВНОЕ ТЕЛО ПРОГРАММЫ
# HFGUFVVF
vis = chotoDrugoe()
for i in vis:
    print(i)
    print()